In [59]:
import requests
r_mia_fl = requests.get("https://api.mashvisor.com/v1.1/client/airbnb-property/market-summary?state=FL&city=Miami", headers={'x-api-key':'5725594e-0d74-42f4-b436-1c822771152b'})
r_orl_fl = requests.get("https://api.mashvisor.com/v1.1/client/airbnb-property/market-summary?state=FL&city=Orlando", headers={'x-api-key':'5725594e-0d74-42f4-b436-1c822771152b'})
r_tpa_fl = requests.get("https://api.mashvisor.com/v1.1/client/airbnb-property/market-summary?state=FL&city=Tampa", headers={'x-api-key':'5725594e-0d74-42f4-b436-1c822771152b'})

In [86]:
import pandas as pd
r_abnb_mia = pd.read_csv('miami_airbnb.csv', index_col=False)
r_abnb_mia

,Property Type,Yearly Occupancy,nightly rate,Monthly Rental Income,Listing_ID
0,"'House',","34,","321,","3317,","10000216',"
1,"Apartment',","43,","81,","1077,","10387018',"
2,"House',","49,","168,","2503,","1048614',"
3,"Apartment',","56,","93,","1573,","10730815',"
4,"Loft',","78,","312,","7410,","11014976',"
...,...,...,...,...,...
995,"House',","75,","110,","2493,","7272204',"
996,"Guesthouse',","64,","53,","1042,","7396280',"
997,"Apartment',","0,","255,","0,","773911',"
998,"Guesthouse',","67,","95,","1924,","775360',"
999,"Guesthouse',","62,","122,","2288,","7837157',"

In [87]:
r_abnb_miafl = r_abnb_mia[['Property Type', 'Listing_ID', 'Yearly Occupancy', 'nightly rate', 'Monthly Rental Income']]
r_abnb_miafl

,Property Type,Listing_ID,Yearly Occupancy,nightly rate,Monthly Rental Income
0,"'House',","10000216',","34,","321,","3317,"
1,"Apartment',","10387018',","43,","81,","1077,"
2,"House',","1048614',","49,","168,","2503,"
3,"Apartment',","10730815',","56,","93,","1573,"
4,"Loft',","11014976',","78,","312,","7410,"
...,...,...,...,...,...
995,"House',","7272204',","75,","110,","2493,"
996,"Guesthouse',","7396280',","64,","53,","1042,"
997,"Apartment',","773911',","0,","255,","0,"
998,"Guesthouse',","775360',","67,","95,","1924,"
999,"Guesthouse',","7837157',","62,","122,","2288,"

In [88]:
r_abnb_miafl.sort_values("Property Type")

,Property Type,Listing_ID,Yearly Occupancy,nightly rate,Monthly Rental Income
0,"'House',","10000216',","34,","321,","3317,"
679,"Apartment',","43441692',","58,","162,","2851,"
680,"Apartment',","43442892',","43,","309,","4079,"
684,"Apartment',","43473010',","16,","199,","945,"
686,"Apartment',","43484722',","60,","118,","2085,"
...,...,...,...,...,...
952,"Villa',","47884705',","84,","2696,","67400,"
31,"Villa',","13154644',","50,","1936,","29685,"
657,"Villa',","42995144',","47,","587,","8316,"
751,"Villa',","44647556',","14,","3250,","13464,"
930,"Villa',","47378127',","49,","556,","8155,"

In [89]:
r_abnb_orl = pd.read_csv('orlando_airbnb.csv', index_col=False)
r_abnb_orl

        Property Type     Listing IDs Occupancy Nightly Rate Monthly Income
0        'Apartment',     '10660163',       86,          58,          1513,
1        'Apartment',      '1225005',       52,          88,          1393,
2        'Apartment',     '13299876',       53,         136,          2210,
3        'Apartment',     '13625502',       85,          57,          1477,
4        'Apartment',     '14666499',       36,          80,           860,
..                ...             ...       ...          ...            ...
550      'Townhouse',     '47069109',       89,          75,          2006,
551      'Townhouse',     '48282384',       90,          96,          2640,
552          'Villa',     '39504775',       68,         106,          2191,
553          'Villa',     '47817690',       41,         104,          1274,
554       Apartment',     '10117384',       25,         101,           766,

[555 rows x 5 columns]

In [90]:
r_abnb_tpa = pd.read_csv('tampa_airbnb.csv', index_col=False)
r_abnb_tpa

,Property Type,Listing Ids,Occupancy,Nightly Rate,Monthly Rental Income
0,'Apartment','9653554',87,52,1376
1,"'Apartment',","'10811316',","93,","59,","1677,"
2,"'Apartment',","'11047853',","22,","134,","884,"
3,"'Apartment',","'11161764',","30,","103,","936,"
4,"'Apartment',","'12157281',","87,","50,","1321,"
...,...,...,...,...,...
763,"'Villa',","'43148625',","41,","1118,","13975,"
764,"'Villa',","'43676838',","71,","75,","1625,"
765,"'Villa',","'44341318',","70,","111,","2387,"
766,"'Villa',","'47788136',","90,","350,","9625,"
767,"'House',","'10193097',","35,","160,","1696,"

In [91]:
rinv_mia = requests.get("https://api.mashvisor.com/v1.1/client/property/43148625/investment?state=FL&payment_type=loan&interest_rate=0.5&loan_type=1&down_payment=100", headers={'x-api-key':'5725594e-0d74-42f4-b436-1c822771152b'})
rinv_mia.json

In [107]:
r_orl_fl = requests.get("https://api.mashvisor.com/v1.1/client/city/investment/FL/Orlando", headers={'x-api-key':'7b9581e3-5b45-4fbc-8f59-d3379db49449'})
orlando=r_orl_fl.json()
orlando

{'status': 'success',
 'content': {'median_price': 270000,
  'sqft': 1626.08,
  'investment_properties': 591,
  'airbnb_properties': 2865,
  'traditional_properties': 2702,
  'occupancy': 55,
  'traditional_coc': 3.00441,
  'airbnb_coc': 1.02023,
  'traditional_rental': 1569.38,
  'airbnb_rental': 1520.83,
  'airbnb_rental_rates': {'zeroBedRoomHomeValue': 1045.93,
   'oneBedRoomHomeValue': 1102.14,
   'twoBedRoomsHomeValue': 1258.97,
   'threeBedRoomsHomeValue': 1968.06,
   'fourBedRoomsHomeValue': 3273.24},
  'traditional_rental_rates': {'zeroBedRoomHomeValue': 1095.74,
   'oneBedRoomHomeValue': 1066.39,
   'twoBedRoomsHomeValue': 1271.45,
   'threeBedRoomsHomeValue': 1606.48,
   'fourBedRoomsHomeValue': 2047.15}},
 'message': 'City Overview fetched successfully'}

In [108]:
orl_df = pd.DataFrame.from_dict(orlando['content'])
orl_df

,median_price,sqft,investment_properties,airbnb_properties,traditional_properties,occupancy,traditional_coc,airbnb_coc,traditional_rental,airbnb_rental,airbnb_rental_rates,traditional_rental_rates
zeroBedRoomHomeValue,270000,1626.08,591,2865,2702,55,3.00441,1.02023,1569.38,1520.83,1045.93,1095.74
oneBedRoomHomeValue,270000,1626.08,591,2865,2702,55,3.00441,1.02023,1569.38,1520.83,1102.14,1066.39
twoBedRoomsHomeValue,270000,1626.08,591,2865,2702,55,3.00441,1.02023,1569.38,1520.83,1258.97,1271.45
threeBedRoomsHomeValue,270000,1626.08,591,2865,2702,55,3.00441,1.02023,1569.38,1520.83,1968.06,1606.48
fourBedRoomsHomeValue,270000,1626.08,591,2865,2702,55,3.00441,1.02023,1569.38,1520.83,3273.24,2047.15

In [115]:
orl_df_drop = orl_df.drop(columns=['median_price', 'sqft','investment_properties', 'occupancy', 'traditional_coc', 'airbnb_coc', 'traditional_rental', 'airbnb_rental'])
orl_df_columns = orl_df_drop[['airbnb_properties','airbnb_rental_rates','traditional_properties','traditional_rental_rates']]
orl_df_columns

,airbnb_properties,airbnb_rental_rates,traditional_properties,traditional_rental_rates
zeroBedRoomHomeValue,2865,1045.93,2702,1095.74
oneBedRoomHomeValue,2865,1102.14,2702,1066.39
twoBedRoomsHomeValue,2865,1258.97,2702,1271.45
threeBedRoomsHomeValue,2865,1968.06,2702,1606.48
fourBedRoomsHomeValue,2865,3273.24,2702,2047.15

In [94]:
r_mia_fl = requests.get("https://api.mashvisor.com/v1.1/client/city/investment/FL/Miami", headers={'x-api-key':'7b9581e3-5b45-4fbc-8f59-d3379db49449'}) 
miami = r_mia_fl.json()
miami

{'status': 'success',
 'content': {'median_price': 450000,
  'sqft': 1512.72,
  'investment_properties': 2988,
  'airbnb_properties': 1884,
  'traditional_properties': 10590,
  'occupancy': 57,
  'traditional_coc': 1.9147,
  'airbnb_coc': 1.04562,
  'traditional_rental': 2139,
  'airbnb_rental': 2955.59,
  'airbnb_rental_rates': {'zeroBedRoomHomeValue': 1259.78,
   'oneBedRoomHomeValue': 1281.78,
   'twoBedRoomsHomeValue': 2068.41,
   'threeBedRoomsHomeValue': 3719.14,
   'fourBedRoomsHomeValue': 6054.51},
  'traditional_rental_rates': {'zeroBedRoomHomeValue': 1170.23,
   'oneBedRoomHomeValue': 1443.92,
   'twoBedRoomsHomeValue': 2103.53,
   'threeBedRoomsHomeValue': 3028.03,
   'fourBedRoomsHomeValue': 5215.58}},
 'message': 'City Overview fetched successfully'}

In [95]:
miami_df = pd.DataFrame.from_dict(miami['content'])
miami_df

,median_price,sqft,investment_properties,airbnb_properties,traditional_properties,occupancy,traditional_coc,airbnb_coc,traditional_rental,airbnb_rental,airbnb_rental_rates,traditional_rental_rates
zeroBedRoomHomeValue,450000,1512.72,2988,1884,10590,57,1.9147,1.04562,2139,2955.59,1259.78,1170.23
oneBedRoomHomeValue,450000,1512.72,2988,1884,10590,57,1.9147,1.04562,2139,2955.59,1281.78,1443.92
twoBedRoomsHomeValue,450000,1512.72,2988,1884,10590,57,1.9147,1.04562,2139,2955.59,2068.41,2103.53
threeBedRoomsHomeValue,450000,1512.72,2988,1884,10590,57,1.9147,1.04562,2139,2955.59,3719.14,3028.03
fourBedRoomsHomeValue,450000,1512.72,2988,1884,10590,57,1.9147,1.04562,2139,2955.59,6054.51,5215.58

In [114]:
miami_df_drop = miami_df.drop(columns=['median_price', 'sqft','investment_properties', 'occupancy', 'traditional_coc', 'airbnb_coc', 'traditional_rental', 'airbnb_rental'])
miami_df_columns = miami_df_drop[['airbnb_properties','airbnb_rental_rates','traditional_properties','traditional_rental_rates']]
miami_df_columns

,airbnb_properties,airbnb_rental_rates,traditional_properties,traditional_rental_rates
zeroBedRoomHomeValue,1884,1259.78,10590,1170.23
oneBedRoomHomeValue,1884,1281.78,10590,1443.92
twoBedRoomsHomeValue,1884,2068.41,10590,2103.53
threeBedRoomsHomeValue,1884,3719.14,10590,3028.03
fourBedRoomsHomeValue,1884,6054.51,10590,5215.58

In [111]:
r_tpa_fl = requests.get("https://api.mashvisor.com/v1.1/client/city/investment/FL/Tampa", headers={'x-api-key':'7b9581e3-5b45-4fbc-8f59-d3379db49449'}) 
tampa= r_tpa_fl.json()
tampa

{'status': 'success',
 'content': {'median_price': 325000,
  'sqft': 1775.04,
  'investment_properties': 465,
  'airbnb_properties': 2571,
  'traditional_properties': 2001,
  'occupancy': 53,
  'traditional_coc': 3.06768,
  'airbnb_coc': 2.80085,
  'traditional_rental': 1674,
  'airbnb_rental': 2278.36,
  'airbnb_rental_rates': {'zeroBedRoomHomeValue': 1068.66,
   'oneBedRoomHomeValue': 1187.08,
   'twoBedRoomsHomeValue': 1491.54,
   'threeBedRoomsHomeValue': 2493.34,
   'fourBedRoomsHomeValue': 3740.01},
  'traditional_rental_rates': {'zeroBedRoomHomeValue': 1064.83,
   'oneBedRoomHomeValue': 1052.79,
   'twoBedRoomsHomeValue': 1314.7,
   'threeBedRoomsHomeValue': 1932.26,
   'fourBedRoomsHomeValue': 2650.66}},
 'message': 'City Overview fetched successfully'}

In [112]:
tpa_df = pd.DataFrame.from_dict(tampa['content'])
tpa_df

,median_price,sqft,investment_properties,airbnb_properties,traditional_properties,occupancy,traditional_coc,airbnb_coc,traditional_rental,airbnb_rental,airbnb_rental_rates,traditional_rental_rates
zeroBedRoomHomeValue,325000,1775.04,465,2571,2001,53,3.06768,2.80085,1674,2278.36,1068.66,1064.83
oneBedRoomHomeValue,325000,1775.04,465,2571,2001,53,3.06768,2.80085,1674,2278.36,1187.08,1052.79
twoBedRoomsHomeValue,325000,1775.04,465,2571,2001,53,3.06768,2.80085,1674,2278.36,1491.54,1314.70
threeBedRoomsHomeValue,325000,1775.04,465,2571,2001,53,3.06768,2.80085,1674,2278.36,2493.34,1932.26
fourBedRoomsHomeValue,325000,1775.04,465,2571,2001,53,3.06768,2.80085,1674,2278.36,3740.01,2650.66

In [117]:
tpa_df_drop = tpa_df.drop(columns=['median_price', 'sqft','investment_properties', 'occupancy', 'traditional_coc', 'airbnb_coc', 'traditional_rental', 'airbnb_rental'])
tpa_df_columns = tpa_df_drop[['airbnb_properties','airbnb_rental_rates','traditional_properties','traditional_rental_rates']]
tpa_df_columns

,airbnb_properties,airbnb_rental_rates,traditional_properties,traditional_rental_rates
zeroBedRoomHomeValue,2571,1068.66,2001,1064.83
oneBedRoomHomeValue,2571,1187.08,2001,1052.79
twoBedRoomsHomeValue,2571,1491.54,2001,1314.70
threeBedRoomsHomeValue,2571,2493.34,2001,1932.26
fourBedRoomsHomeValue,2571,3740.01,2001,2650.66